Revit 2024 API
BuiltInFailures.DimensionFailures.ChangeSpotElevationFailed Property
 Can't change Spot Elevation to the desired value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ChangeSpotElevationFailed { get; }
Visual Basic
Public Shared ReadOnly Property ChangeSpotElevationFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ChangeSpotElevationFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace